//B1401 JOB (1),'SIM1401 TOM BROWN',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=HERC01,PASSWORD=CUL8TR
//STEP1 EXEC PGM=B1401
//CARDOUT DD DUMMY
//WRITE DD SYSOUT=*
//CARDIN DD *
THIS IS A DUMMY CARD
,008015,022029,036043,050054,055062,063065,066077/333/M0762502F1.HELLO WORLD
//
