//B1401 JOB (1),'SIM1401 TOM BROWN',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),
//             USER=HERC01,PASSWORD=CUL8TR
//STEP1 EXEC PGM=B1401
//CARDOUT DD DUMMY
//WRITE DD SYSOUT=*
//CARDIN DD UNIT=10C,DCB=BLKSIZE=80
//
